ErwinAlo/AngryVoiceRecognition-ESP32-S3-N16R8/src/main.cpp
#include <Arduino.h>
#include <MD_MAX72xx.h>
#include "driver/i2s.h"
#include "soc/i2s_reg.h"
#include <esp_wifi.h>
#include <esp_bt.h>
#include "SD.h"
#include "SPI.h"
#include "MFCC.h"
#include "emotions.h"
#include "esp32-hal-timer.h"
#include "NeuralNetwork.h"
#include "tensorflow/lite/c/common.h"

int i = 0;

// --- DEFINICIÓN DE PINES ---
#define BUZZER_PIN 18
#define MOSI_PIN   13
#define SCK_PIN    14
#define CS_PIN     10
#define NUM_MAT    1 

// Pines I2S micro 
#define I2S_LRCL   7
#define I2S_DOUT   1
#define I2S_BCLK   2

#define BUFLEN SHAPE_INPUT

static const i2s_port_t i2s_num = I2S_NUM_0;
size_t number_bytes_read;
NeuralNetwork *nn = nullptr;

MD_MAX72XX mxObj = MD_MAX72XX(MD_MAX72XX::GENERIC_HW, MOSI_PIN, SCK_PIN, CS_PIN, NUM_MAT);
int Mat[1] = {0};
String emotion_vec[] = {"Other","Angry"};

// Configuración I2S 
static const i2s_config_t i2s_config = {
  .mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX),
  .sample_rate = 16000,
  .bits_per_sample = I2S_BITS_PER_SAMPLE_32BIT,
  .channel_format = I2S_CHANNEL_FMT_ONLY_RIGHT,
  .communication_format = (i2s_comm_format_t)(I2S_COMM_FORMAT_STAND_I2S), 
  .intr_alloc_flags = ESP_INTR_FLAG_LEVEL1,
  .dma_buf_count = 64,
  .dma_buf_len = 512,
  .use_apll = false
};

static const i2s_pin_config_t pin_config = {
  .bck_io_num = I2S_BCLK,
  .ws_io_num = I2S_LRCL,
  .data_out_num = I2S_PIN_NO_CHANGE,
  .data_in_num = I2S_DOUT
};

// PROTOTIPOS
void audio_normalized(int32_t *raw_signal, float *normalized_signal);
int interprets_output(TfLiteTensor *outputTensor);
float** allocate_mfcc_matrix_psram(int rows, int cols);
void free_mfcc_matrix_psram(float **matrix, int rows);
float* allocate_float_array_psram(size_t size);
void free_float_array_psram(float *arr);
int32_t* allocate_int32_array_psram(size_t size);
void free_int32_array_psram(int32_t *arr);

void setup() { 
  Serial.begin(115200);
  delay(1000);
  
  Serial.println("\n\n===================================");
  Serial.println("Iniciando ESP32-S3 con PSRAM...");
  Serial.println("===================================");

  esp_bt_controller_disable();
  esp_wifi_stop();

  pinMode(BUZZER_PIN, OUTPUT);
  digitalWrite(BUZZER_PIN, LOW);

  nn = new NeuralNetwork();
  if (!nn->begin()) {
    while (1) {
      digitalWrite(BUZZER_PIN, HIGH); delay(100);
      digitalWrite(BUZZER_PIN, LOW); delay(100);
    }
  }

  mxObj.begin();
  mxObj.clear();
  mxObj.control(MD_MAX72XX::INTENSITY, 1);
  emotion(0, Mat, 0, mxObj);

  i2s_driver_install(i2s_num, &i2s_config, 0, NULL);
  i2s_set_pin(i2s_num, &pin_config);
  i2s_set_clk(i2s_num, 16000, I2S_BITS_PER_SAMPLE_32BIT, I2S_CHANNEL_MONO);
  i2s_zero_dma_buffer(i2s_num);
  
  Serial.println("(Sistemas listos)");
}

void loop() {
  int32_t *raw_signal = allocate_int32_array_psram(BUFLEN);
  if (!raw_signal) return;
  
  esp_err_t err = i2s_read(i2s_num, raw_signal, BUFLEN * sizeof(int32_t), &number_bytes_read, portMAX_DELAY);
  
  if (err == ESP_OK && number_bytes_read >= BUFLEN * sizeof(int32_t)) {
    float *inputAudio = allocate_float_array_psram(BUFLEN);
    if (!inputAudio) { free_int32_array_psram(raw_signal); return; }

    audio_normalized(raw_signal, inputAudio);
    free_int32_array_psram(raw_signal);

    float energia = 0;
    for (int j = 0; j < BUFLEN; j++) energia += abs(inputAudio[j]);
    energia /= BUFLEN;

    // Filtro básico de energía
    if (energia < 0.15) { 
        if (i % 20 == 0) Serial.printf("Silencio detectado (E: %.4f)\n", energia); 
        emotion(0, Mat, 0, mxObj);
        digitalWrite(BUZZER_PIN, LOW);
        free_float_array_psram(inputAudio);
        return; 
    }

    float **mfcc_mat = allocate_mfcc_matrix_psram(MEL_BANDS, NUMBER_OF_WINDOWS);
    if (!mfcc_mat) { free_float_array_psram(inputAudio); return; }

    long int t1 = micros();
    mfccs(inputAudio, mfcc_mat);
    long int t2 = micros();
    free_float_array_psram(inputAudio);

    float *inputBuffer = nn->getInputBuffer();
    if (inputBuffer) {
      int index = 0;
      for (int r = 0; r < MEL_BANDS; r++) {
        for (int c = 0; c < NUMBER_OF_WINDOWS; c++) {
          inputBuffer[index++] = mfcc_mat[r][c];
        }
      }
    }
    free_mfcc_matrix_psram(mfcc_mat, MEL_BANDS);

    long int t3 = micros();
    bool success = nn->predict();
    long int t4 = micros();

    if (success) {
      TfLiteTensor *outputTensor = nn->getOutputTensor();
      
      Serial.printf("\n------------------- Iteración: %d ----------------\n", i++);
      
      int feeling = interprets_output(outputTensor);
      emotion(feeling, Mat, 0, mxObj);
      digitalWrite(BUZZER_PIN, (feeling == 1) ? HIGH : LOW);

      // --- SALIDA DETALLADA ESTILO ANTERIOR ---
      //Serial.printf("Energía: %.4f\n", energia);
      Serial.printf("\nTiempo MFCC: %.2f ms\n", (t2 - t1) / 1000.0);
      Serial.printf("Tiempo Inferencia: %.2f ms\n", (t4 - t3) / 1000.0);
      Serial.printf("Tiempo Total: %.2f ms\n", (t4 - t1) / 1000.0);
      
      // Información de memoria
      size_t freeRAM = heap_caps_get_free_size(MALLOC_CAP_INTERNAL);
      size_t freePSRAM = heap_caps_get_free_size(MALLOC_CAP_SPIRAM);
      Serial.printf("RAM Libre: %d KB | PSRAM Libre: %d KB\n", freeRAM / 1024, freePSRAM / 1024);
      
      Serial.println("--------------------------------------------------\n");
    }
  } else {
    free_int32_array_psram(raw_signal);
  }
}

// IMPLEMENTACIÓN DE FUNCIONES

void audio_normalized(int32_t *raw_signal, float *normalized_signal) {
    float sum = 0;
    for(int j = 0; j < BUFLEN; j++) {
        raw_signal[j] &= 0xFFFFFF00;    // Elimina datos de bits significativos
        sum += (float)(raw_signal[j] >> 14);
    }
    float mean = sum / BUFLEN;

    for(int j = 0; j < BUFLEN; j++) {
        float centered = ((float)(raw_signal[j] >> 14)) - mean;
        float val = centered / 100000.0f; 
        if (val > 1.0f) val = 1.0f;
        if (val < -1.0f) val = -1.0f;
        normalized_signal[j] = val;
    }
}

int interprets_output(TfLiteTensor *outputTensor) {
    if (!outputTensor || !outputTensor->data.f) return 0;
    
    // 1. Obtener el valor crudo (0.0 a 1.0)
    float val_angry = outputTensor->data.f[0];
    float val_other = 1.0f - val_angry;
    
    // 2. Determinar el resultado (Umbral 0.5)
    int result = (val_angry >= 0.5) ? 1 : 0;

    // 3. Crear la barra visual [##########----------]
    String barra = "[";
    int longitudBarra = 20; 
    int rellenos = (int)(val_angry * longitudBarra);
    for (int j = 0; j < longitudBarra; j++) {
        if (j < rellenos) barra += "#"; 
        else barra += "-";
    }
    barra += "]";

    // --- SALIDA AL MONITOR SERIAL ---
    // Mantenemos tu salida original exacta:
    Serial.printf("Salida: %.6f - %s\n", val_angry, emotion_vec[result].c_str());
    
    // Agregamos el monitor de porcentajes y escala
    //Serial.println(">>> COMPARATIVO DE CONFIANZA <<<");
    Serial.printf("\nANGRY: %d%%  %s  OTHER: %d%%\n", (int)(val_angry*100), barra.c_str(), (int)(val_other*100));
    
    return result;
}

float** allocate_mfcc_matrix_psram(int rows, int cols) {
  float **matrix = new float*[rows];
  for (int j = 0; j < rows; j++) {
    matrix[j] = (float*)heap_caps_malloc(cols * sizeof(float), MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (!matrix[j]) return nullptr;
  }
  return matrix;
}

void free_mfcc_matrix_psram(float **matrix, int rows) {
  if (!matrix) return;
  for (int j = 0; j < rows; j++) if (matrix[j]) heap_caps_free(matrix[j]);
  delete[] matrix;
}

float* allocate_float_array_psram(size_t size) {
  return (float*)heap_caps_malloc(size * sizeof(float), MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
}

void free_float_array_psram(float *arr) { if (arr) heap_caps_free(arr); }

int32_t* allocate_int32_array_psram(size_t size) {
  return (int32_t*)heap_caps_malloc(size * sizeof(int32_t), MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
}

void free_int32_array_psram(int32_t *arr) { if (arr) heap_caps_free(arr); }